# day22

In [10]:
import pandas as pd
import numpy as np

In [11]:
name = ["Carol","Kate","Jane","Kuda","Tito","Kuku"]
age = [23,np.nan,34,56,np.nan,44]

In [12]:
df = pd.DataFrame({"Name": name , "Age": age})

In [13]:
df

    Name   Age
0  Carol  23.0
1   Kate   NaN
2   Jane  34.0
3   Kuda  56.0
4   Tito   NaN
5   Kuku  44.0

In [93]:
df.loc[pd.isna(df["Age"]) ,"Age"].size

2

AttributeError: module 'pandas' has no attribute 'size'

In [46]:
df2 = df.copy()

In [48]:
df2.dropna()

    Name   Age
0  Carol  23.0
2   Jane  34.0
3   Kuda  56.0
5   Kuku  44.0

In [49]:
df3 = df.copy()

In [59]:
df3.fillna(np.mean(df["Age"]),inplace = True)

In [60]:
df3.insert(2,"Gender",["F","F","F","M","M","M"])

ValueError: cannot insert Gender, already exists

In [61]:
df3

    Name    Age Gender
0  Carol  23.00      F
1   Kate  39.25      F
2   Jane  34.00      F
3   Kuda  56.00      M
4   Tito  39.25      M
5   Kuku  44.00      M

In [67]:
df4 = pd.melt(df3,"Name")
df4

     Name variable  value
0   Carol      Age   23.0
1    Kate      Age  39.25
2    Jane      Age   34.0
3    Kuda      Age   56.0
4    Tito      Age  39.25
5    Kuku      Age   44.0
6   Carol   Gender      F
7    Kate   Gender      F
8    Jane   Gender      F
9    Kuda   Gender      M
10   Tito   Gender      M
11   Kuku   Gender      M

In [82]:
df5 = df4.where(df4["variable"] == "Gender").dropna()

In [104]:
df5.columns = df5.columns.str.upper()

In [105]:
df5

     NAME VARIABLE VALUE
6   Carol   Gender     F
7    Kate   Gender     F
8    Jane   Gender     F
9    Kuda   Gender     M
10   Tito   Gender     M
11   Kuku   Gender     M